#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/naga-paritala/terraform-samples/runs/run-VR1X1TvJKp1Wnxf9

Waiting for the plan to start...

Terraform v0.14.0
Configuring remote state backend...
Initializing Terraform configuration...
module.vpc.aws_vpc.main_vpc: Refreshing state... [id=vpc-0af4cdbf74c2e3904]
module.vpc.aws_internet_gateway.main_internet_gateway: Refreshing state... [id=igw-078291574fa90d066]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.vpc.aws_internet_gateway.main_internet_gateway will be updated in-place
  ~ resource "aws_internet_gateway" "main_internet_gateway" {
        id       = "igw-078291574fa90d066"
        tags     = {}
      ~ vpc_id   = "vpc-0af4cdbf74c2e3904" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.private_be will be created
  + resource "aws_subnet" "private_be" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = (known after apply)
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.100.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "Private"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_subnet.private_db will be created
  + resource "aws_subnet" "private_db" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = (known after apply)
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.200.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "Private"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_subnet.public_fe will be created
  + resource "aws_subnet" "public_fe" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = (known after apply)
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.1.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "Public"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_vpc.main_vpc must be replaced
-/+ resource "aws_vpc" "main_vpc" {
      ~ arn                              = "arn:aws:ec2:us-east-1:801210904757:vpc/vpc-0af4cdbf74c2e3904" -> (known after apply)
      ~ cidr_block                       = "10.0.0.0/24" -> "10.0.0.0/16" # forces replacement
      ~ default_network_acl_id           = "acl-07bd3b2af028dc679" -> (known after apply)
      ~ default_route_table_id           = "rtb-041b37f4043202a07" -> (known after apply)
      ~ default_security_group_id        = "sg-012e9752e01613e9a" -> (known after apply)
      ~ dhcp_options_id                  = "dopt-7e8e3704" -> (known after apply)
      ~ enable_classiclink               = false -> (known after apply)
      ~ enable_classiclink_dns_support   = false -> (known after apply)
      ~ enable_dns_hostnames             = false -> (known after apply)
      ~ id                               = "vpc-0af4cdbf74c2e3904" -> (known after apply)
      + ipv6_association_id              = (known after apply)
      + ipv6_cidr_block                  = (known after apply)
      ~ main_route_table_id              = "rtb-041b37f4043202a07" -> (known after apply)
      ~ owner_id                         = "801210904757" -> (known after apply)
      - tags                             = {} -> null
        # (3 unchanged attributes hidden)
    }

Plan: 4 to add, 1 to change, 1 to destroy.

Changes to Outputs:
  + vpc_id = (known after apply)
```
</details>
*Pusher: @malliparitala, Action: `pull_request`*